tutorials/catalyticZonesReactingFoam/adiOxidativeCouplingMethaneLH/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.org 0
runApplication blockMesh
runApplication topoSet
runApplication $(getApplication)

runApplication postProcess -func sample -latestTime

#------------------------------------------------------------------------------
